In [40]:
import numpy as np
import pandas as pd

from numpy.random import randn

In [2]:
import sys
print(sys.executable)

C:\Program Files\Python313\python.exe

In [ ]:
# py -3.13 -m pip install ipykernel 
# py -3.13 -m ipykernel install --user --name pykerna1l3.13   # creating the new kernel name

In [3]:
labels = ['a','b','c'] # list of the characters
mylist = [10,20,30] # list of the numbers
nparr = np.array([10,20,30]) # numpy array
dict = {'a':10, 'b':20, 'c':30} # dictionary

In [5]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [6]:
pd.Series(mylist)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(nparr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(dict,index = labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(data = labels) # Series can store any datatype

0    a
1    b
2    c
dtype: object

In [17]:
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [19]:
ser1 = pd.Series([1,2,3,4], index = ['India', 'England', 'Scotland', 'Wales'])

In [24]:
ser2 = pd.Series([1,2,3], index = ['India', 'England', 'Northern Ireland'])

In [21]:
ser1

India       1
England     2
Scotland    3
Wales       4
dtype: int64

In [25]:
ser1 + ser2

England             4.0
India               2.0
Northern Ireland    NaN
Scotland            NaN
Wales               NaN
dtype: float64

In [26]:
ser1['England']

np.int64(2)

In [28]:
ser1['India']

np.int64(1)

In [42]:
# Working with DataFrames

df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [43]:
df

          W         X         Y         Z
A -0.187999  0.049539  0.335866  0.084085
B  1.297847 -1.108180 -0.165935 -0.671803
C  0.222723 -1.002635 -2.677276  1.092241
D -0.801870 -0.350656 -1.918094  1.136762
E -0.251430 -1.283802  0.091183  0.361180

In [51]:
df['W']

A   -0.187999
B    1.297847
C    0.222723
D   -0.801870
E   -0.251430
Name: W, dtype: float64

In [52]:
type(df['W'])

pandas.core.series.Series

In [53]:
type(df)

pandas.core.frame.DataFrame

In [61]:
df['NEW'] = df['W'] + df['X']

In [62]:
df

          W         X         Y         Z       NEW
A -0.187999  0.049539  0.335866  0.084085 -0.138460
B  1.297847 -1.108180 -0.165935 -0.671803  0.189667
C  0.222723 -1.002635 -2.677276  1.092241 -0.779912
D -0.801870 -0.350656 -1.918094  1.136762 -1.152525
E -0.251430 -1.283802  0.091183  0.361180 -1.535231

In [57]:
df.drop('NEW', axis = 1) # axis = 0 is the index or rows

          W         X         Y         Z
A -0.187999  0.049539  0.335866  0.084085
B  1.297847 -1.108180 -0.165935 -0.671803
C  0.222723 -1.002635 -2.677276  1.092241
D -0.801870 -0.350656 -1.918094  1.136762
E -0.251430 -1.283802  0.091183  0.361180

In [63]:
df.drop('NEW', axis = 1, inplace = True) # inplace to be used if you want the effect to be permanent.

In [64]:
df

          W         X         Y         Z
A -0.187999  0.049539  0.335866  0.084085
B  1.297847 -1.108180 -0.165935 -0.671803
C  0.222723 -1.002635 -2.677276  1.092241
D -0.801870 -0.350656 -1.918094  1.136762
E -0.251430 -1.283802  0.091183  0.361180

In [65]:
df.loc['A'] # based on the column label argument.

W   -0.187999
X    0.049539
Y    0.335866
Z    0.084085
Name: A, dtype: float64

In [66]:
df.iloc[1] # for the numerical argument for the index

W    1.297847
X   -1.108180
Y   -0.165935
Z   -0.671803
Name: B, dtype: float64

In [67]:
df.loc['A','X']

np.float64(0.049539284241870735)

In [69]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.187999  0.335866
B  1.297847 -0.165935

In [70]:
df.shape

(5, 4)

In [72]:
df > 0

       W      X      Y      Z
A  False   True   True   True
B   True  False  False  False
C   True  False  False   True
D  False  False  False   True
E  False  False   True   True

In [73]:
booldf = df > 0
booldf

       W      X      Y      Z
A  False   True   True   True
B   True  False  False  False
C   True  False  False   True
D  False  False  False   True
E  False  False   True   True

In [74]:
df[booldf]

          W         X         Y         Z
A       NaN  0.049539  0.335866  0.084085
B  1.297847       NaN       NaN       NaN
C  0.222723       NaN       NaN  1.092241
D       NaN       NaN       NaN  1.136762
E       NaN       NaN  0.091183  0.361180

In [76]:
df[df['W'] > 0] # it will eliminate any value which is NaN

          W         X         Y         Z
B  1.297847 -1.108180 -0.165935 -0.671803
C  0.222723 -1.002635 -2.677276  1.092241

In [79]:
df[df['Z'] < 0]

          W        X         Y         Z
B  1.297847 -1.10818 -0.165935 -0.671803

In [83]:
resultdf = df[df['W'] > 0]
resultdf

          W         X         Y         Z
B  1.297847 -1.108180 -0.165935 -0.671803
C  0.222723 -1.002635 -2.677276  1.092241

In [84]:
df[df['W']>0]['X']

B   -1.108180
C   -1.002635
Name: X, dtype: float64

In [96]:
boolser = df['W'] > 0

In [97]:
boolser

A    False
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [100]:
result = df[boolser]
mycols = ['X','Y']

In [102]:
result[mycols]

          X         Y
B -1.108180 -0.165935
C -1.002635 -2.677276

In [110]:
# more than one conditions on the data frame
df

          W         X         Y         Z
A -0.187999  0.049539  0.335866  0.084085
B  1.297847 -1.108180 -0.165935 -0.671803
C  0.222723 -1.002635 -2.677276  1.092241
D -0.801870 -0.350656 -1.918094  1.136762
E -0.251430 -1.283802  0.091183  0.361180

In [116]:
df[(df['W'] < 0) | (df['X'] > 0)]

          W         X         Y         Z
A -0.187999  0.049539  0.335866  0.084085
D -0.801870 -0.350656 -1.918094  1.136762
E -0.251430 -1.283802  0.091183  0.361180

In [117]:
df[(df['W'] < 0) & (df['X'] > 0)]

          W         X         Y         Z
A -0.187999  0.049539  0.335866  0.084085

In [118]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.187999  0.049539  0.335866  0.084085
1     B  1.297847 -1.108180 -0.165935 -0.671803
2     C  0.222723 -1.002635 -2.677276  1.092241
3     D -0.801870 -0.350656 -1.918094  1.136762
4     E -0.251430 -1.283802  0.091183  0.361180

In [119]:
newstates = 'CA NY WY OR CO'.split()
newstates

['CA', 'NY', 'WY', 'OR', 'CO']

In [122]:
df['States'] = newstates

In [123]:
df

          W         X         Y         Z States
A -0.187999  0.049539  0.335866  0.084085     CA
B  1.297847 -1.108180 -0.165935 -0.671803     NY
C  0.222723 -1.002635 -2.677276  1.092241     WY
D -0.801870 -0.350656 -1.918094  1.136762     OR
E -0.251430 -1.283802  0.091183  0.361180     CO

In [139]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.187999  0.049539  0.335866  0.084085
NY      1.297847 -1.108180 -0.165935 -0.671803
WY      0.222723 -1.002635 -2.677276  1.092241
OR     -0.801870 -0.350656 -1.918094  1.136762
CO     -0.251430 -1.283802  0.091183  0.361180

In [141]:
df.reset_index()
df

          W         X         Y         Z States
A -0.187999  0.049539  0.335866  0.084085     CA
B  1.297847 -1.108180 -0.165935 -0.671803     NY
C  0.222723 -1.002635 -2.677276  1.092241     WY
D -0.801870 -0.350656 -1.918094  1.136762     OR
E -0.251430 -1.283802  0.091183  0.361180     CO

# Dataframe Part 3

In [149]:
# Indexing levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [150]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [153]:
df = pd.DataFrame(randn(6,2),hier_index,['A', 'B'])

In [154]:
df

             A         B
G1 1  0.626013 -0.078729
   2 -0.526622 -0.033951
   3  0.214837  1.065324
G2 1  0.476986  1.180960
   2  1.499987  0.234680
   3 -0.832748  0.719236

In [159]:
df.loc['G1']

          A         B
1  0.626013 -0.078729
2 -0.526622 -0.033951
3  0.214837  1.065324

In [161]:
df.index.names = ['Groups', 'Num']

In [162]:
df

                   A         B
Groups Num
G1     1    0.626013 -0.078729
       2   -0.526622 -0.033951
       3    0.214837  1.065324
G2     1    0.476986  1.180960
       2    1.499987  0.234680
       3   -0.832748  0.719236

In [163]:
# using the cross section to select the data fromt he table.

df.xs('G1')

            A         B
Num
1    0.626013 -0.078729
2   -0.526622 -0.033951
3    0.214837  1.065324

In [164]:
df.xs(1, level='Num')

               A         B
Groups
G1      0.626013 -0.078729
G2      0.476986  1.180960

In [165]:
df

                   A         B
Groups Num
G1     1    0.626013 -0.078729
       2   -0.526622 -0.033951
       3    0.214837  1.065324
G2     1    0.476986  1.180960
       2    1.499987  0.234680
       3   -0.832748  0.719236